// 1 Запитай у користувача радіус кола і виведи площу такої окружності.

let radius = prompt("Введіть радіус кола (число):");
let area = Math.PI * radius ** 2;

alert(`Площа кола з радіусом ${radius} дорівнює  ${area.toFixed(2)}`);


// 2 Запитай у користувача відстань в кілометрах між двома містами і 
// за скільки годин він хоче дістатися.Порахуй швидкість, з якою необхідно рухатися, щоб встигнути вчасно.

let distance = prompt("Введіть відстань між містами в кілометрах (число)");
let time = prompt("Введіть, за скільки годин ви хочете дістатися (число)");

let speed = distance / time;

alert(`Щоб подолати відстань ${distance} км за ${time} годин, потрібно рухатися зі швидкістю ${speed.toFixed(2)} км/год.`);


// 3 Реалізуй конвертор валют.Користувач вводить долари, програма переводить їх в євро.Курс валют зберігається в константі.

let inputDollars = prompt("Введіть кількість доларів, яку потрібно обміняти на євро (число)");
const exchangeRate = 0.85;
let outputEuros = inputDollars * exchangeRate;
alert(`У результаті обміну ви матимете ${outputEuros.toFixed(2)} євро`);