// 2. Тобі потрібно зберігати ім’я та прізвище в змінній, придумай до 4 - х імен змінних,
// що потрібні тобі для даної задачі.Також напиши до 5 неправильних імен(неправильні імена повинні бути закоментовані);



const firstName = 'Nata';
const lastName = 'Kasianova';

const age = 42;
const email = 'nata@gmail.com';
const city = 'Poltava';
const isMarried = false;

/* Неправильні імена змінних
const first Name = 'Nata'; - ім'я змінної не може містити пропуски
const last-Name = 'Kas'; - зміннf не може містити дефісів
const email@ = 'nata@gmail.com'; -не може містити спеціальних символів
const Age = '35'; - зазвичай використовуємо камелКейс, погана практика починати з Великої літери
const full name = firstName_lastName; - не може містити пропуски */

// 3. Коментарі - Однорядкові

// Цей коментар займає весь рядок
alert('Привіт');

alert('Світ'); // Цей коментар міститься після інструкції

/* багато
рядкові
коментарі */

// Вкладені коментарі не підтримуються!     Не може бути /*...*/ всередині /*...*/ .

// 4. Які стилі написання імен змінних ти знаєш ?

// 1 - camelCase(також називається lowerCamelCase) - стиль, в якому перша буква кожного слова, крім першого, велика, а всі решта букв малі.Наприклад: firstName, lastName, productCategory.

// 2 - PascalCase(також називається UpperCamelCase) - стиль, в якому перша буква кожного слова велика, а всі решта букв малі.Наприклад: FirstName, LastName, ProductCategory.

// 3 - Snake Case - стиль, в якому слова в імені змінної розділяються символом нижнього підкреслення.Наприклад: first_name, last_name, product_category.

// 4- Kebab Case - стиль, в якому слова в імені змінної розділяються дефісами.Наприклад: first-name, last-name, product-category.

// 5 - Hungarian Notation - стиль, в якому перед ім'ям змінної вказується префікс, що вказує на тип даних, які зберігаються в цій змінній. Наприклад: strFirstName, arrProductList, intAge.