// 1 Запитай ім’я користувача та виведи у відповідь “Привіт, *ім’я*”;

let firstName = prompt("Введіть ваше ім'я: ");
alert(`Привіт, ${firstName}!`);

// 2 Запитай рік народження користувача, порахуй його / її вік і виведи результат.Поточний рік вкажи в коді як константу;

const currentYear = 2023; // поточний рік
let birthYear = prompt("Введіть ваш рік народження (повністю):");

let age = currentYear - birthYear; // розрахунок віку користувача

alert(`Вам ${age} рок(-и)(-ів)!`); //  результат

// 3 Запитай у користувача довжину сторони квадрату і виведи периметр цього квадрата

let side = prompt("Введіть довжину сторони квадрата без одиниць виміру:");
let perimeter = 4 * side;

alert(`Периметр квадрата зі стороною ${side} дорівнює ${perimeter}`);